       IDENTIFICATION DIVISION.
      *SAMPLE CODE FOR GITHUB
       PROGRAM-ID. SAMPLE.
       AUTHOR. Enterprise Cobol.

       ENVIRONMENT DIVISION.

       FILE DIVISION.

       PROCEDURE DIVISION.

       9999-END-PROGRAM.
           GOBACK
