       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDREDIT.
       AUTHOR. FABIO COSTA.
      ******************************************************************
      * INSERT HERE WHAT THE PROGRAM DOES
      ******************************************************************


       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
           COPY SUPADDRS. *>SUPP-ADDRESS Copybook

       PROCEDURE DIVISION.
