       01  STATEZIP-LIST OCCURS 3000 TIMES ASCENDING KEY IS STATE-ACRO.
           05  STATE-NAME       PIC X(15) VALUE SPACES.
           05  FILLER           PIC X(1) VALUE SPACES.
           05  STATE-ACRO       PIC X(2) VALUE SPACES.
           05  FILLER           PIC X(1) VALUE SPACES.
           05  STATEZIP-START   PIC X(5) VALUE SPACES.
           05  FILLER           PIC X(1) VALUE SPACES.
           05  STATEZIP-END     PIC X(5) VALUE SPACES.

       01  STATEZIP-INDEX       PIC 9(4) VALUE 1.
